In [1]:
from sqlalchemy import create_engine
import pandas as pd
from warnings import filterwarnings
import pymysql
filterwarnings('ignore', category=pymysql.Warning)
import os
import json

In [2]:
file_name = os.path.join("C:/Users/gpalv/Desktop/KU BootCamp Homework/my_sql_pass.json")
data = json.load(open(file_name))

In [3]:
password = data['my_sql']

In [4]:
engine = create_engine('mysql+pymysql://root:{}@localhost/sakila'.format(password))

In [5]:
def RunSQL(sql_command):
        connection = pymysql.connect(host='localhost',
                                 user='root',
                                 password= password,
                                 db='sakila',
                                 charset='utf8mb4',
                                 cursorclass=pymysql.cursors.DictCursor)
        try:
            with connection.cursor() as cursor:
                commands = sql_command.split(';')
                for command in commands:
                    if command == '\\n': 
                        continue
                    cursor.execute(command + ';')
                    connection.commit()
        except Exception as e: 
            print(e)
        finally:
            connection.close()

1a:

In [6]:
sql_query = """
select * from actor;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [7]:
sql_query = """
select first_name, last_name
from actor;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

  first_name     last_name
0   PENELOPE       GUINESS
1       NICK      WAHLBERG
2         ED         CHASE
3   JENNIFER         DAVIS
4     JOHNNY  LOLLOBRIGIDA

1b:

In [8]:
sql_query = """
select UPPER(CONCAT(actor.first_name, ' ', actor.last_name)) AS 'Actor Name'
from actor;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

            Actor Name
0     PENELOPE GUINESS
1        NICK WAHLBERG
2             ED CHASE
3       JENNIFER DAVIS
4  JOHNNY LOLLOBRIGIDA

2a:

In [9]:
sql_query = """
select actor_id, first_name, last_name 
from actor
where first_name like 'Joe';
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   actor_id first_name last_name
0         9        JOE     SWANK

2b:

In [10]:
sql_query = """
select actor_id, first_name, last_name 
from actor
where last_name like '%%GEN%%';
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   actor_id first_name  last_name
0        14     VIVIEN     BERGEN
1        41      JODIE  DEGENERES
2       107       GINA  DEGENERES
3       166       NICK  DEGENERES

2c:

In [11]:
sql_query = """
select actor_id, first_name, last_name 
from actor
where last_name like '%%LI%%'
order by last_name, first_name desc;;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   actor_id first_name last_name
0        86       GREG   CHAPLIN
1        82      WOODY     JOLIE
2        15       CUBA   OLIVIER
3        34     AUDREY   OLIVIER
4        72       SEAN  WILLIAMS

2d:

In [12]:
sql_query = """
select country_id, country
from country
where country in ('Afghanistan', 'Bangladesh', 'China');
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   country_id      country
0           1  Afghanistan
1          12   Bangladesh
2          23        China

3a:

In [13]:
sql_query = """
ALTER TABLE actor 
ADD middle_name VARCHAR(255) 
after first_name;
"""
RunSQL(sql_query)

(1065, 'Query was empty')

In [14]:
sql_query = """
select * from actor;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head(2)

   actor_id first_name middle_name last_name         last_update
0         1   PENELOPE        None   GUINESS 2006-02-15 04:34:33
1         2       NICK        None  WAHLBERG 2006-02-15 04:34:33

3b:

In [15]:
sql_query = """
ALTER TABLE actor CHANGE middle_name blobs VARCHAR(255);
"""
RunSQL(sql_query)

(1065, 'Query was empty')

In [16]:
sql_query = """
select * from actor;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head(2)

   actor_id first_name blobs last_name         last_update
0         1   PENELOPE  None   GUINESS 2006-02-15 04:34:33
1         2       NICK  None  WAHLBERG 2006-02-15 04:34:33

3c:

In [17]:
sql_query = """
ALTER TABLE actor DROP blobs;
"""
RunSQL(sql_query)

(1065, 'Query was empty')

In [18]:
sql_query = """
select * from actor;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head(2)

   actor_id first_name last_name         last_update
0         1   PENELOPE   GUINESS 2006-02-15 04:34:33
1         2       NICK  WAHLBERG 2006-02-15 04:34:33

4a:

In [19]:
sql_query = """
select last_name, COUNT(last_name) AS 'count'
from actor
GROUP BY last_name
ORDER BY COUNT(last_name) DESC
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   last_name  count
0     KILMER      5
1     TEMPLE      4
2      NOLTE      4
3  JOHANSSON      3
4   WILLIAMS      3

4b:

In [20]:
sql_query = """
select last_name, COUNT(last_name) AS 'count'
from actor
GROUP BY last_name
having count(*) > 1
ORDER BY COUNT(last_name) DESC
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   last_name  count
0     KILMER      5
1     TEMPLE      4
2      NOLTE      4
3  ZELLWEGER      3
4       PECK      3

4c:

In [21]:
sql_query = """
select * from actor
where first_name = 'GROUCHO';
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   actor_id first_name last_name         last_update
0        78    GROUCHO   SINATRA 2006-02-15 04:34:33
1       106    GROUCHO     DUNST 2006-02-15 04:34:33
2       172    GROUCHO  WILLIAMS 2018-02-27 17:56:54

In [22]:
sql_query = """
UPDATE actor
SET first_name = 'HARPO'
where actor_id = '172'
"""
RunSQL(sql_query)

In [23]:
sql_query = """
select * from actor
where first_name = 'HARPO';
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   actor_id first_name last_name         last_update
0       172      HARPO  WILLIAMS 2018-03-01 09:19:05

4d:

In [24]:
sql_query = """
UPDATE actor
SET first_name = 'GROUCHO'
WHERE actor_id = '172';
"""
RunSQL(sql_query)

(1065, 'Query was empty')

In [25]:
sql_query = """
select * from actor
where first_name = 'GROUCHO';
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   actor_id first_name last_name         last_update
0        78    GROUCHO   SINATRA 2006-02-15 04:34:33
1       106    GROUCHO     DUNST 2006-02-15 04:34:33
2       172    GROUCHO  WILLIAMS 2018-03-01 09:19:19

5a:

In [26]:
sql_query = """
SHOW CREATE TABLE address;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

     Table                                       Create Table
0  address  CREATE TABLE `address` (\n  `address_id` small...

6a:

In [27]:
sql_query = """
select * from address;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head(2)

,address_id,address,address2,district,city_id,postal_code,phone,location,last_update
0,1,47 MySakila Drive,None,Alberta,300,,,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00>\n2]c4\...,2014-09-25 22:30:27
1,2,28 MySQL Boulevard,None,QLD,576,,,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x8e\x10...,2014-09-25 22:30:09

In [28]:
sql_query = """
select * from staff;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head(2)

,staff_id,first_name,last_name,address_id,picture,email,store_id,active,username,password,last_update
0,1,Mike,Hillyer,3,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 03:57:16
1,2,Jon,Stephens,4,None,Jon.Stephens@sakilastaff.com,2,1,Jon,None,2006-02-15 03:57:16

In [29]:
sql_query = """
select first_name, last_name, address
from staff s
join address a
using (address_id)
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

  first_name last_name               address
0       Mike   Hillyer     23 Workhaven Lane
1        Jon  Stephens  1411 Lillydale Drive

6b:

In [30]:
sql_query = """
select * from payment;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head(2)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76.0,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573.0,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30

In [31]:
sql_query = """
select first_name, last_name, amount, payment_date
from payment p 
join staff s
using (staff_id)
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

  first_name last_name  amount        payment_date
0       Mike   Hillyer    2.99 2005-05-25 11:30:37
1       Mike   Hillyer    0.99 2005-05-28 10:35:23
2       Mike   Hillyer    5.99 2005-06-15 00:54:12
3       Mike   Hillyer    4.99 2005-06-16 15:18:57
4       Mike   Hillyer    4.99 2005-06-18 08:41:48

6c:

In [32]:
sql_query = """
select * from film;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head(1)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42

In [33]:
sql_query = """
select * from film_actor;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head(1)

   actor_id  film_id         last_update
0         1        1 2006-02-15 05:05:03

In [34]:
sql_query = """
select title, film_id, actor_id
from film f
join film_actor fa
using (film_id)
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head(1)

              title  film_id  actor_id
0  ACADEMY DINOSAUR        1         1

In [35]:
sql_query = """
select film_id, COUNT(actor_id) AS 'number_of_actors'
from film_actor
GROUP BY actor_id
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head(1)

   film_id  number_of_actors
0        1                19

In [36]:
sql_query = """
select film_id, title, COUNT(actor_id) AS 'Number Of Actors'
from film f
join film_actor fa
using (film_id)
GROUP BY actor_id
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   film_id                 title  Number Of Actors
0        1      ACADEMY DINOSAUR                19
1        3      ADAPTATION HOLES                25
2       17            ALONE TRIP                22
3       23  ANACONDA CONFESSIONS                22
4       19          AMADEUS HOLY                29

6d:

In [37]:
sql_query = """
select * from inventory;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head(1)

   inventory_id  film_id  store_id         last_update
0             1        1         1 2006-02-15 05:09:17

In [38]:
sql_query = """
select film.title, film.film_id from film
where film.title = 'Hunchback Impossible';
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

                  title  film_id
0  HUNCHBACK IMPOSSIBLE      439

In [39]:
sql_query = """
select * from inventory
where inventory.film_id = 439;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return

   inventory_id  film_id  store_id         last_update
0          2017      439         1 2006-02-15 05:09:17
1          2018      439         1 2006-02-15 05:09:17
2          2019      439         1 2006-02-15 05:09:17
3          2020      439         1 2006-02-15 05:09:17
4          2021      439         2 2006-02-15 05:09:17
5          2022      439         2 2006-02-15 05:09:17

6e:

In [40]:
sql_query = """
select * from customer;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head(1)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [41]:
sql_query = """
select * from payment;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head(1)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76.0,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30

In [42]:
sql_query = """
select first_name, last_name, sum(amount) AS 'Total Amount Paid'
from customer c
join payment p
using (customer_id)
GROUP BY last_name
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head(10)

  first_name  last_name  Total Amount Paid
0     RAFAEL      ABNEY              97.79
1  NATHANIEL       ADAM             133.72
2   KATHLEEN      ADAMS              92.73
3      DIANA  ALEXANDER             105.73
4     GORDON     ALLARD             160.68
5    SHIRLEY      ALLEN             126.69
6   CHARLENE    ALVAREZ             114.73
7       LISA   ANDERSON             106.76
8       JOSE     ANDREW              96.75
9        IDA    ANDREWS              76.77

7a:

In [43]:
sql_query = """
    select * from language;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   language_id      name         last_update
0            1   English 2006-02-15 05:02:19
1            2   Italian 2006-02-15 05:02:19
2            3  Japanese 2006-02-15 05:02:19
3            4  Mandarin 2006-02-15 05:02:19
4            5    French 2006-02-15 05:02:19

In [44]:
sql_query = """
select * from film;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head(1)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42

In [45]:
sql_query = """
select title
from film
where language_id IN
(
  select language_id
  from language
  where title like 'Q%%' AND language_id = '1'
);
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

             title
0       QUEEN LUKE
1  QUEST MUSSOLINI
2      QUILLS BULL

In [46]:
sql_query = """
select title
from film
where language_id IN
(
  select language_id
  from language
  where title like 'k%%' AND language_id = '1'
);
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

              title
0     KANE EXORCIST
1       KARATE MOON
2  KENTUCKIAN GIANT
3     KICK SAVANNAH
4  KILL BROTHERHOOD

7b:

In [47]:
sql_query = """
    select first_name, last_name
    from actor
    where actor_id IN
    (
     select actor_id 
     from film_actor
     where film_id IN
     (
      select film_id
      from film
      where film.title = 'Alone Trip'
      )
     );
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return

  first_name last_name
0         ED     CHASE
1       KARL     BERRY
2        UMA      WOOD
3      WOODY     JOLIE
4    SPENCER      DEPP
5      CHRIS      DEPP
6   LAURENCE   BULLOCK
7      RENEE      BALL

7c:

In [48]:
sql_query = """
select country, email AS 'Canadian Customers'
from country k
inner join city c on k.country_id = c.country_id
inner join address a on c.city_id = a.city_id
inner join customer cu on a.address_id = cu.address_id
where country = 'Canada'
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return

  country                    Canadian Customers
0  Canada    DERRICK.BOURQUE@sakilacustomer.org
1  Canada      DARRELL.POWER@sakilacustomer.org
2  Canada  LORETTA.CARPENTER@sakilacustomer.org
3  Canada        CURTIS.IRBY@sakilacustomer.org
4  Canada       TROY.QUIGLEY@sakilacustomer.org

7d:

In [49]:
sql_query = """
    select title
    from film
    where film_id IN
    (
     select film_id 
     from film_category
     where category_id IN
     (
      select category_id
      from category
      where name = 'Family'
      )
     );
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

             title
0      AFRICAN EGG
1    APACHE DIVINE
2   ATLANTIS CAUSE
3  BAKED CLEOPATRA
4        BANG KWAI

In [50]:
sql_query = """
select title
from film f
join film_category fc
using (film_id)
where category_id = '8'
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

             title
0      AFRICAN EGG
1    APACHE DIVINE
2   ATLANTIS CAUSE
3  BAKED CLEOPATRA
4        BANG KWAI

7e:

In [51]:
sql_query = """
select rental_id, rental_date, return_date
from rental
ORDER BY (return_date) DESC;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   rental_id         rental_date         return_date
0      16005 2005-08-23 21:00:22 2005-09-02 02:35:22
1      16040 2005-08-23 22:19:33 2005-09-02 02:19:33
2      15971 2005-08-23 19:59:33 2005-09-02 01:28:33
3      15928 2005-08-23 18:23:24 2005-09-01 23:43:24
4      15922 2005-08-23 18:07:31 2005-09-01 22:27:31

7f:

In [52]:
sql_query = """
select * from payment;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76.0,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573.0,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30
2,3,1,1,1185.0,5.99,2005-06-15 00:54:12,2006-02-15 22:12:30
3,4,1,2,1422.0,0.99,2005-06-15 18:02:53,2006-02-15 22:12:30
4,5,1,2,1476.0,9.99,2005-06-15 21:08:46,2006-02-15 22:12:30

In [53]:
sql_query = """
select store_id, sum(amount) AS '($) Total Amount Paid'
from customer c
join payment p
using (customer_id)
GROUP BY store_id;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return

   store_id  ($) Total Amount Paid
0         1               37001.52
1         2               30414.99

7g:

In [54]:
# Store 1
sql_query = """
select store_id, country, city, address
from country k
inner join city c on k.country_id = c.country_id
inner join address a on c.city_id = a.city_id
inner join store s on a.address_id = s.address_id
where store_id = '1';
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return

   store_id country        city            address
0         1  Canada  Lethbridge  47 MySakila Drive

In [55]:
# Store 2
sql_query = """
select store_id, country, city, address
from country k
inner join city c on k.country_id = c.country_id
inner join address a on c.city_id = a.city_id
inner join store s on a.address_id = s.address_id
where store_id = '2';
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return

   store_id    country       city             address
0         2  Australia  Woodridge  28 MySQL Boulevard

7h:

In [56]:
sql_query = """
select store_id, name, sum(amount) AS '($) Gross Revenue'
from category ka
inner join film_category fm on ka.category_id = fm.category_id
inner join inventory i on fm.film_id = i.film_id
inner join rental r on i.inventory_id = r.inventory_id
inner join payment p on r.customer_id = p.customer_id
GROUP BY name 
ORDER BY amount DESC;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   store_id      name  ($) Gross Revenue
0         1    Sci-Fi          127768.37
1         1  Children          109727.41
2         1    Travel           97279.09
3         1       New          110441.67
4         1    Comedy          110384.27

8a:

In [57]:
sql_query = """
create view top_five_genres as
select store_id, name, sum(amount) AS '($) Gross Revenue'
from category ka
inner join film_category fm on ka.category_id = fm.category_id
inner join inventory i on fm.film_id = i.film_id
inner join rental r on i.inventory_id = r.inventory_id
inner join payment p on r.customer_id = p.customer_id
GROUP BY name 
ORDER BY amount DESC;
"""
RunSQL(sql_query)

(1065, 'Query was empty')

8b:

In [58]:
sql_query = """
select * from top_five_genres;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   store_id       name  ($) Gross Revenue
0         1     Sci-Fi          127768.37
1         1   Children          109727.41
2         1  Animation          137116.48
3         1      Drama          122052.28
4         1    Foreign          120780.50

8c:

In [59]:
RunSQL('drop view top_five_genres')